src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтатусПредставленияДокумента(Статус) Экспорт
	
	Если Статус = Перечисления.мп_СтатусыОбмена.Создан Тогда
		Возврат "Документ создан";
	ИначеЕсли Статус = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		Возврат "Документ зарегистрирован к выгрузке";
	ИначеЕсли Статус = Перечисления.мп_СтатусыОбмена.ВыгруженвКИС Тогда
		Возврат "Документ выгружен в КИС";
	ИначеЕсли Статус = Перечисления.мп_СтатусыОбмена.ЗагруженизКИС Тогда
		Возврат "Документ загружен из КИС";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.мп_СтатусыОбмена.Создан);
	Список.Добавить(Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС);
	
	ДанныеВыбора = Список;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
